---
kind: method
id: M:Autodesk.Revit.DB.FaceArrayIterator.#ctor
source: html/2ceb5304-e2ee-1345-a4c3-7ffca0f37be2.htm
---
# Autodesk.Revit.DB.FaceArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public FaceArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.